In [36]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 4, 7, 9])

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s

0    1
1    4
2    7
3    9
dtype: int64

In [5]:
names = ["Amit", "Mohan", "Saif", "Ravi"]

In [6]:
ages = [23, 20, 21, 25]

In [7]:
data = {"names" : names, "ages" : ages}

In [8]:
data

{'names': ['Amit', 'Mohan', 'Saif', 'Ravi'], 'ages': [23, 20, 21, 25]}

In [10]:
df = pd.DataFrame.from_dict(data)

In [11]:
df

   names  ages
0   Amit    23
1  Mohan    20
2   Saif    21
3   Ravi    25

In [20]:
names = ["Amit", "Mohan", "Saif", "Ravi", "Mohan"]

ages = [23, 20, (21, 22) , 25, None]

data = {"names" : names, "ages" : ages}

NameError: name 'NaN' is not defined

In [18]:
db = pd.DataFrame.from_dict(data)

In [19]:
db

   names      ages
0   Amit        23
1  Mohan        20
2   Saif  (21, 22)
3   Ravi        25
4  Mohan      None

In [16]:
db.to_csv("happy.csv")

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
names    4 non-null object
ages     4 non-null int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [23]:
df.dtypes

names    object
ages      int64
dtype: object

In [25]:
ans = df.describe()

In [26]:
type(ans)

pandas.core.frame.DataFrame

In [29]:
df.tail(2)

  names  ages
2  Saif    21
3  Ravi    25

In [30]:
df.to_numpy()

array([['Amit', 23],
       ['Mohan', 20],
       ['Saif', 21],
       ['Ravi', 25]], dtype=object)

In [32]:
cal = df.values

In [35]:
pd.DataFrame(cal, columns=["Names", "Ages"])

   Names Ages
0   Amit   23
1  Mohan   20
2   Saif   21
3   Ravi   25

In [38]:
arr = np.arange(100).reshape(-1, 5)

In [63]:
names = ["Age", "Height", "Weight", "Fat", "B P"]

In [64]:
df = pd.DataFrame(arr, columns=names)

In [65]:
df

    Age  Height  Weight  Fat  B P
0     0       1       2    3    4
1     5       6       7    8    9
2    10      11      12   13   14
3    15      16      17   18   19
4    20      21      22   23   24
5    25      26      27   28   29
6    30      31      32   33   34
7    35      36      37   38   39
8    40      41      42   43   44
9    45      46      47   48   49
10   50      51      52   53   54
11   55      56      57   58   59
12   60      61      62   63   64
13   65      66      67   68   69
14   70      71      72   73   74
15   75      76      77   78   79
16   80      81      82   83   84
17   85      86      87   88   89
18   90      91      92   93   94
19   95      96      97   98   99

In [66]:
df["Age"]

0      0
1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
11    55
12    60
13    65
14    70
15    75
16    80
17    85
18    90
19    95
Name: Age, dtype: int64

In [67]:
data

{'names': ['Amit', 'Mohan', 'Saif', 'Ravi', 'Mohan'],
 'ages': [23, 20, (21, 22), 25, None]}

In [68]:
df[["Age", "Fat"]]

    Age  Fat
0     0    3
1     5    8
2    10   13
3    15   18
4    20   23
5    25   28
6    30   33
7    35   38
8    40   43
9    45   48
10   50   53
11   55   58
12   60   63
13   65   68
14   70   73
15   75   78
16   80   83
17   85   88
18   90   93
19   95   98

In [72]:
df["B P"][8]

44

In [73]:
vals = range(20)

In [74]:
df["Faltu"] = vals

In [75]:
df

    Age  Height  Weight  Fat  B P  Faltu
0     0       1       2    3    4      0
1     5       6       7    8    9      1
2    10      11      12   13   14      2
3    15      16      17   18   19      3
4    20      21      22   23   24      4
5    25      26      27   28   29      5
6    30      31      32   33   34      6
7    35      36      37   38   39      7
8    40      41      42   43   44      8
9    45      46      47   48   49      9
10   50      51      52   53   54     10
11   55      56      57   58   59     11
12   60      61      62   63   64     12
13   65      66      67   68   69     13
14   70      71      72   73   74     14
15   75      76      77   78   79     15
16   80      81      82   83   84     16
17   85      86      87   88   89     17
18   90      91      92   93   94     18
19   95      96      97   98   99     19

In [78]:
temp = pd.read_csv?

In [79]:
temp = pd.read_csv("happy.csv", index_col=0)

In [80]:
temp

   names  ages
0   Amit    23
1  Mohan    20
3   Saif    35
2   Ravi    25

In [81]:
temp.sort_index()

   names  ages
0   Amit    23
1  Mohan    20
2   Ravi    25
3   Saif    35

In [83]:
temp.sort_values?

In [84]:
df

    Age  Height  Weight  Fat  B P  Faltu
0     0       1       2    3    4      0
1     5       6       7    8    9      1
2    10      11      12   13   14      2
3    15      16      17   18   19      3
4    20      21      22   23   24      4
5    25      26      27   28   29      5
6    30      31      32   33   34      6
7    35      36      37   38   39      7
8    40      41      42   43   44      8
9    45      46      47   48   49      9
10   50      51      52   53   54     10
11   55      56      57   58   59     11
12   60      61      62   63   64     12
13   65      66      67   68   69     13
14   70      71      72   73   74     14
15   75      76      77   78   79     15
16   80      81      82   83   84     16
17   85      86      87   88   89     17
18   90      91      92   93   94     18
19   95      96      97   98   99     19

In [92]:
df.iloc[3:5, 0:2]

   Age  Height
3   15      16
4   20      21

In [93]:
temp

   names  ages
0   Amit    23
1  Mohan    20
3   Saif    35
2   Ravi    25

In [98]:
rows = temp.names < "Don"

In [97]:
'A' < 'a'

True

In [100]:
temp.loc[rows]

  names  ages
0  Amit    23